{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "faad0f4a",
   "metadata": {},
   "source": [
    "## Вариант 19\n",
    "## Задача 1\n",
    "В Берляндии есть особый туристический маршрут — Золотое кольцо. Этот маршрут состоит из 𝑛 городов и циклического железнодорожного маршрута. Города пронумерованы от 1 до 𝑛 таким образом, что:\n",
    "\n",
    "следующим городом для 1 является город 2;\n",
    "следующим городом для 2 является город 3;\n",
    "...\n",
    "следующим городом для 𝑛 является город 1.\n",
    "Таким образом, маршрут замкнут в цикл, города пронумерованы по ходу движения (маршрут — односторонний).\n",
    "\n",
    "Блогер Поликарп хочет начать своё путешествие в городе 1. Про каждый город он знает величину 𝑎𝑖 — сколько селфи он хочет сделать в 𝑖-м городе. За одно посещение города он может сделать там не более одного селфи. Так как он едет на поезде, то города он пропускать не может (он всегда перемещается из города 𝑖 в город 𝑖+1 для 1≤𝑖<𝑛 и из 𝑛 в 1). Таким образом, когда поезд останавливается в городе, то Поликарп обязательно посещает этот город. Если Поликарп посещает город многократно, то все посещения учитываются отдельно.\n",
    "\n",
    "Какое наименьшее количество посещений городов придётся Поликарпу совершить, чтобы выполнить свой план по количеству селфи для каждого города? Учтите, что первым он всегда посещает город 1, так как именно в этом городе начинается его путешествие.\n",
    "\n",
    "Входные данные\n",
    "В первой строке записано целое число 𝑛 (3≤𝑛≤2⋅105) — количество городов в Золотом кольце Берляндии.\n",
    "\n",
    "Следующая строка содержит 𝑛 целых чисел 𝑎1,𝑎2,…,𝑎𝑛 (0≤𝑎𝑖≤109), где 𝑎𝑖 равно требуемому количеству селфи в 𝑖-м городе.\n",
    "\n",
    "Гарантируется, что хотя бы одно из чисел 𝑎𝑖 строго больше нуля.\n",
    "\n",
    "Выходные данные\n",
    "Выведите едиственное целое число — искомое минимальное количество посещений.\n",
    "\n",
    "Примеры\n",
    "входные данные\n",
    "3\n",
    "1 0 0\n",
    "выходные данные\n",
    "1\n",
    "входные данные\n",
    "3\n",
    "2 0 2\n",
    "выходные данные\n",
    "6"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "b3e3ae3c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Кол-во городов: 5\n",
      "Введите кол-во селфи для каждого из 5 городов:\n",
      "1000000000 1000000000 1000000000 1000000000 0\n",
      "4999999999\n"
     ]
    }
   ],
   "source": [
    "from itertools import count\n",
    "\n",
    "def lastmax(sequence):\n",
    "    return max(zip(sequence, count()))\n",
    "\n",
    "n = int(input(\"Кол-во городов: \"))\n",
    "an = []\n",
    "print(f\"Введите кол-во селфи для каждого из {n} городов:\")\n",
    "\n",
    "selfies = input().split(\" \")\n",
    "\n",
    "for i in selfies:\n",
    "    an.append(i)\n",
    "\n",
    "    \n",
    "d1 = {}\n",
    "\n",
    "\n",
    "for i in range(1,len(an)+1):\n",
    "    d1[i] = int(an[i-1])\n",
    "\n",
    "\n",
    "max_selfie = max(d1.values())\n",
    "\n",
    "\n",
    "c = lastmax(d1.values())[1]+1\n",
    "res = max_selfie*n - (n-c)\n",
    "print(res)\n",
    "                    \n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1fafe990",
   "metadata": {},
   "source": [
    "## Задача 2\n",
    "Вы помните, как гордый Кай льдинками выкладывал слово «вечность»? Маленький Шелдон играет с кубиками, на каждом из которых изображена одна цифра от 0 до 9 (включительно). Шелдон выкладывает свое любимое число t. Он понял, что цифры 6 и 9 настолько похожи, что перевернув кубик с цифрой 6 получается кубик с цифрой 9 (и наоборот). Аналогичная ситуация имеет место и для кубиков с цифрами 2 и 5. Остальные цифры не подвержены подобному феномену, который маленький Шелдон называет «цифровой мимикрией».\n",
    "\n",
    "Шелдон очень любит число t. Настолько, что хочет его видеть перед собой в наибольшем количестве экземпляров. Какое количество раз Шелдон сможет сложить свое любимое число t, используя заданный набор кубиков? Разумеется, каждый кубик может быть использован не более чем в одном экземпляре числа t. Сложив некоторый экземпляр числа t, Шелдон более не трогает его и кубики, использованные в этом экземпляре.\n",
    "\n",
    "Входные данные\n",
    "В первой строке входного файла записано целое положительное число t (1 ≤ t ≤ 10000), t — любимое число Шелдона. Вторая строка содержит последовательность цифр, изображенных на кубиках Шелдона. Длина последовательности от 1 до 200, она содержит только цифры от 0 до 9 и не содержит пробелов.\n",
    "\n",
    "Выходные данные\n",
    "Выведите максимально количество экземпляров числа t, которое может сложить Шелдон. Допускается использование кубика 6 в качестве кубика 9 (и наоборот), аналогично с кубиками 2 и 5. Каждый кубик может быть использован не более чем в одном экземпляре числа t.\n",
    "\n",
    "Примеры\n",
    "входные данные\n",
    "42\n",
    "23454\n",
    "выходные данные\n",
    "2\n",
    "входные данные\n",
    "169\n",
    "12118999\n",
    "выходные данные\n",
    "1"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "0a907b35",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "169\n",
      "69\n",
      "0\n"
     ]
    }
   ],
   "source": [
    "t = input().replace('5', '2').replace('9', '6')\n",
    "seq = input().replace('5', '2').replace('9', '6')\n",
    "\n",
    "count = 10000\n",
    "\n",
    "for i in t:\n",
    "    count = min(count, seq.count(i) // t.count(i))\n",
    "print(count)\n",
    "        \n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "108652c3",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
